# Pandas Lib

In [3]:
import pandas as pd

In [11]:
#seris 
s=pd.Series([23,4,45,56,67,89])
print(s)

0    23
1     4
2    45
3    56
4    67
5    89
dtype: int64

In [13]:
s[2]=7

In [15]:
print(s)

0    23
1     4
2     7
3    56
4    67
5    89
dtype: int64

In [29]:
print(s[3])# in series  the Size is IMMUATBLE but DATA is MUTABLE
s.size

56

6

In [21]:

s.dtype

dtype('int64')

In [23]:
s.size

6

In [39]:
s=pd.Series([23,4,45,56,67,89],index=range(100,106)) # Index 
s

100    23
101     4
102    45
103    56
104    67
105    89
dtype: int64

In [41]:
## Dataframes 
roll=pd.Series([1,2,3,4,5])
name=pd.Series(['atharv','om','riya','geeta','sai'])
marks=pd.Series([90,78,56,45,54])

In [45]:
df=pd.DataFrame({
    'roll':roll,
    'name':name,
    'marks':marks
})
df

   roll    name  marks
0     1  atharv     90
1     2      om     78
2     3    riya     56
3     4   geeta     45
4     5     sai     54

In [47]:
df.shape

(5, 3)

In [49]:
df.size

15

In [51]:
df.columns

Index(['roll', 'name', 'marks'], dtype='object')

In [69]:
# https://mitu.co.in/dataset
# download all the files starting from student
import os 
os.getcwd
# Weare giving the file in our laptop therefore we hav to provide the acess to it

In [85]:
import pandas as pd 
df1=pd.read_csv(r'C:\Users\athar\Downloads\student.csv') # r'c: ........................\student.csv
print(df1)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [93]:
 #methods on seris 
df1['name'].str.title() # gives the first letter capital

0       Anil
1       Amit
2     Aniket
3    Ajinkya
4       Asha
5     Ayesha
6       Amar
7      Amita
8       Amol
9      Anmol
Name: name, dtype: object

In [105]:
df1['name'].str.startswith("Anil") # false = correct , true=incorrect

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: name, dtype: bool

In [109]:
df1['roll']=df1['roll']+100

In [111]:
df1

   roll     name class  marks  age
0   201     anil    TE  56.77   22
1   202     amit    TE  59.77   21
2   203   aniket    BE  76.88   19
3   204  ajinkya    TE  69.66   20
4   205     asha    TE  63.28   20
5   206   ayesha    BE  49.55   20
6   207     amar    BE  65.34   19
7   208    amita    BE  68.33   23
8   209     amol    TE  56.75   20
9   210    anmol    BE  78.66   21

In [113]:
# want to add new column 

gender= ['m','m','m','m','f','f','m','m','m','m']

df1['gender']=gender
df1

   roll     name class  marks  age gender
0   201     anil    TE  56.77   22      m
1   202     amit    TE  59.77   21      m
2   203   aniket    BE  76.88   19      m
3   204  ajinkya    TE  69.66   20      m
4   205     asha    TE  63.28   20      f
5   206   ayesha    BE  49.55   20      f
6   207     amar    BE  65.34   19      m
7   208    amita    BE  68.33   23      m
8   209     amol    TE  56.75   20      m
9   210    anmol    BE  78.66   21      m

In [121]:
df1['gender'].value_counts() # Gives the total values of the m and f 
# mode is the highest frequenccy count i.e m not 7

gender
m    8
f    2
Name: count, dtype: int64

In [123]:
df1['gender'].mode()

0    m
Name: gender, dtype: object

In [125]:
df1['class'].mode()

0    BE
1    TE
Name: class, dtype: object

In [127]:
# Now I want to access the BE #BE FINAL YEAR #TE THIRD YEAR 
df1['class'].mode()[0]

'BE'

In [129]:
# maximum marks ,  std deviation ,minimummarks etc called the " agrigate Function "

df['marks'].min() # it gives in whole column

45

In [133]:
gr=df1.groupby('class') ## Group By operations

In [135]:
gr.get_group("TE") # Gives only the TE Class

   roll     name class  marks  age gender
0   201     anil    TE  56.77   22      m
1   202     amit    TE  59.77   21      m
3   204  ajinkya    TE  69.66   20      m
4   205     asha    TE  63.28   20      f
8   209     amol    TE  56.75   20      m

In [139]:
gr.groups

{'BE': [2, 5, 6, 7, 9], 'TE': [0, 1, 3, 4, 8]}

In [141]:
gr['marks'].min() # Gives category wise Minimum marks

class
BE    49.55
TE    56.75
Name: marks, dtype: float64

In [143]:
# Filtering the data 
df1['marks']>60

0    False
1    False
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9     True
Name: marks, dtype: bool

In [151]:
# But I want the data not true false value 
df1[df1['marks']>60]

   roll     name class  marks  age gender
2   203   aniket    BE  76.88   19      m
3   204  ajinkya    TE  69.66   20      m
4   205     asha    TE  63.28   20      f
6   207     amar    BE  65.34   19      m
7   208    amita    BE  68.33   23      m
9   210    anmol    BE  78.66   21      m

In [165]:
# filter out greter than 60 and belongs to BE class 
df1[(df1['marks']>60 ) & (df1['class']=='BE') ] # here we use the '&' not 'and'

   roll    name class  marks  age gender
2   203  aniket    BE  76.88   19      m
6   207    amar    BE  65.34   19      m
7   208   amita    BE  68.33   23      m
9   210   anmol    BE  78.66   21      m

In [157]:
# storing the result in the Locally
result=df1[(df1['marks']>60 ) & (df1['class']=='BE') ] # here we use the '&' not 'and'

In [159]:
result.to_csv('output.csv',index='False')  # I don't want the indexes of teh file in the output file